cf_billing/Documents/энргУстановитьВидДифференцированностиПриборУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргУстановитьВидДифференцированностиПриборУчета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.энргЗарегистрированныйОбъемПриборов</xr:Item>
				<xr:Item>InformationRegister.энргПоказанияПриборовУчета</xr:Item>
				<xr:Item>InformationRegister.энргВидыДифференцированностиПриборовУчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьАдресОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>160</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьМКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтрокиВывод</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеПрибора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоказанияПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Переворот</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнихПоказаний</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереворотИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныйОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПоказаний</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргСостояниеПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентПУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыводПрибораУчета</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтклонения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргПричиныОтклоненияПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШкалыПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтрокиТочкиУчета</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДифференцированности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шкала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргЗарегистрированныйОбъемПриборов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргЗарегистрированныйОбъемПриборов</Name>
			<Comment>Зарегистрированный объем потребления приборов</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъемУслугиПотребленный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/Catalogs/энргКлючиПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргКлючиПомещений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Documents/энргУстановитьВидДифференцированностиПриборУчета/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция МассивПриборов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",				Ссылка);
	Текст  			= 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТочекУчета.ПриборУчета КАК ПриборУчета,
	|	ТаблицаПоказаний.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	0 КАК Разделитель,
	|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти
	|ИЗ
	|	Документ.энргУстановитьВидДифференцированностиПриборУчета.ТочкиУчета КАК ТаблицаТочекУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьВидДифференцированностиПриборУчета.ШкалыПриборовУчета КАК ШкалыПриборовУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьВидДифференцированностиПриборУчета.ПоказанияПриборовУчета КАК ТаблицаПоказаний
	|			ПО ШкалыПриборовУчета.Ссылка = ТаблицаПоказаний.Ссылка
	|				И ШкалыПриборовУчета.IDСтроки = ТаблицаПоказаний.IDСтроки
	|		ПО ТаблицаТочекУчета.Ссылка = ШкалыПриборовУчета.Ссылка
	|			И ТаблицаТочекУчета.IDСтрокиВывод = ШкалыПриборовУчета.IDСтрокиТочкиУчета
	|			И (ТаблицаТочекУчета.Ссылка = &Ссылка)
	|			И (ШкалыПриборовУчета.Ссылка = &Ссылка)
	|			И (НЕ ТаблицаТочекУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))";
	
	Запрос.Текст 	= Текст; 	
	ДополнительныеСвойства.Вставить("МассивПриборов",Запрос.Выполнить());
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
		
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный = Пользователи.ТекущийПользователь();			
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);  	
	
	ДанныеШапки = ДанныеШапки();
		
	энргРаботаСприборамиУчетаСервер.УстановитьВидДифференцированностиПриборовУчета(ДанныеШапки,Движения);
	энргРаботаСприборамиУчетаСервер.ЗаписатьПоказанияРезультатЗапроса(ДанныеШапки,Движения);
	
	Результат = ПолучитьОбъемыПУ(); 	
	энргПроведениеСервер.ВыполнитьДвиженияПоРезультатуЗапроса(Результат, Движения.энргЗарегистрированныйОбъемПриборов);
	
	Выборка = Результат.Выбрать();
	НаборРасчетСреднего = РегистрыСведений.энргРасчетСреднегоОбъема.СоздатьНаборЗаписей();
	НаборРасчетСреднего.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования",истина);
	Пока Выборка.Следующий() Цикл 
		
		СтрокаНабор = НаборРасчетСреднего.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаНабор,Выборка);	
		СтрокаНабор.ОбъемУслуги = Выборка.ОбъемУслугиПотребленный;
		
	КонецЦикла;
	НаборРасчетСреднего.Записать(Ложь);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеШапки()
	
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Дата",					?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Район",					Район); 
	ДанныеШапки.Вставить("Организация",				Организация);
	ДанныеШапки.Вставить("ПериодРегистрации",		Дата);
	ДанныеШапки.Вставить("ПериодНачисления",		ПериодНачисления); 	
	ДанныеШапки.Вставить("Абонент",					Абонент);
	ДанныеШапки.Вставить("КлючПомещения",			КлючПомещения);
	ДанныеШапки.Вставить("Документ",				Ссылка);  	
	
	Возврат ДанныеШапки;
	
КонецФункции

Функция ПолучитьОбъемыПУ()
	
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	&ДокументСсылка КАК ДокРегистратор,
	               |	ВложенныйЗапрос.Район КАК Район,
	               |	ВложенныйЗапрос.Организация КАК Организация,
	               |	ВложенныйЗапрос.Шкала КАК Шкала,
	               |	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	               |	ТаблицаПоказанийПриборовУчета.Разница КАК ОбъемУслугиПотребленный,
	               |	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	               |	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	               |	энргКлючиПомещений.Строение КАК Строение,
	               |	энргКлючиПомещений.Помещение КАК Помещение,
	               |	ВложенныйЗапрос.Период КАК Период,
	               |	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ТаблицаПриборовУчета.Ссылка КАК Ссылка,
	               |		ТаблицаПриборовУчета.ПриборУчета КАК ПриборУчета,
	               |		ТаблицаШкал.Шкала КАК Шкала,
	               |		ТаблицаШкал.IDСтроки КАК IDСтроки,
	               |		ТаблицаДокумента.Организация КАК Организация,
	               |		ТаблицаДокумента.Район КАК Район,
	               |		ТаблицаДокумента.КлючПомещения КАК КлючПомещения,
	               |		ТаблицаДокумента.ПериодНачисления КАК ПериодНачисления,
	               |		ТаблицаПриборовУчета.ТочкаУчета КАК ТочкаУчета,
	               |		ТаблицаПриборовУчета.ПриборУчета.РегистрируетОбъем КАК РегистрируетОбъем,
	               |		&Период КАК Период
	               |	ИЗ
	               |		Документ.энргУстановитьВидДифференцированностиПриборУчета.ТочкиУчета КАК ТаблицаПриборовУчета
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьВидДифференцированностиПриборУчета.ШкалыПриборовУчета КАК ТаблицаШкал
	               |			ПО ТаблицаПриборовУчета.Ссылка = ТаблицаШкал.Ссылка
	               |				И ТаблицаПриборовУчета.IDСтрокиВывод = ТаблицаШкал.IDСтрокиТочкиУчета
	               |				И (ТаблицаПриборовУчета.Ссылка = &ДокументСсылка)
	               |				И (ТаблицаШкал.Ссылка = &ДокументСсылка)
	               |				И (НЕ ТаблицаПриборовУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьВидДифференцированностиПриборУчета КАК ТаблицаДокумента
	               |			ПО ТаблицаПриборовУчета.Ссылка = ТаблицаДокумента.Ссылка
	               |				И (ТаблицаПриборовУчета.Ссылка = &ДокументСсылка)
	               |				И (ТаблицаДокумента.Ссылка = &ДокументСсылка)) КАК ВложенныйЗапрос
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьВидДифференцированностиПриборУчета.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
	               |		ПО ВложенныйЗапрос.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
	               |			И ВложенныйЗапрос.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтроки
	               |			И (ТаблицаПоказанийПриборовУчета.Ссылка = &ДокументСсылка)
	               |			И (ВложенныйЗапрос.РегистрируетОбъем)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	               |		ПО ВложенныйЗапрос.КлючПомещения = энргКлючиПомещений.Ссылка";
	
	Запрос.УстановитьПараметр("ДокументСсылка"	,Ссылка);
	Запрос.УстановитьПараметр("Период"			,Дата);
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
